"use strict";

// day 4

//! Это инторполяция в ES6 использовалось раньше так:
// ?  const category = 'toys';
//?   console.log('`https://mrcrodo.com/' + '/' + '5');


// const category = 'toys';

// console.log(`https://mrcrodo.com/${category}/5`);

// const user = "Ivan";

// alert(`Привет, ${user}`);

// ***************************
// Если мы число прибавляем к числовому выражению в ковычках то получается
// 55 а точнее строка как бы строки присоединяются
// console.log(typeof(5 + "5"));
// Но есди мы перед тем значением что в кавычках поставим +
// тогда получаем число
// console.log(5 + +"7");
// в члучае же умножения мы получаем число
// сы получам число в обоих члуяаях когда число на число и когда число на члово
//  в обоих случаях получем числовой тип значения
// console.log(typeof(5 * "7"));
// console.log(typeof(5 * "Hello"));



let incr =  10,
    decr = 10;

    incr++; // операция инкриента или увелисения значения  на 1
    decr--;  // операция декремента или уменшения хначения на 1

    console.log(incr);
    console.log(decr);
    
    console.log(typeof 7);